Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: ### Determining What Is Introduced ###
es: ### Revisando lo introducido ###

source: Last, like the Git and Local protocols, SSH is efficient, making the data as compact as possible before transferring it.
es: Y, por último, al igual que los procolos Git y Local, SSH es eficiente, comprimiendo los datos lo más posible antes de transferirlos.

source: Git will ask you which files you would like to partially stage; then, for each section of the selected files, it will display hunks of the file diff and ask if you would like to stage them, one by one:
es: Git preguntará cual es el archivo a pasar parcialmente al área de preparación. Y después irá mostrando trozos de las distintas secciones modificadas en el archivo, preguntando por cada una si se desea pasar o no al área de preparación:

source: The most straightforward way to specify a commit requires that it have a branch reference pointed at it.
es: La manera más directa de referirse a una confirmación de cambios es teniendo una rama apuntando a ella.

source: You can also do the opposite — make changes in the `rack` subdirectory of your master branch and then merge them into your `rack_branch` branch later to submit them to the maintainers or push them upstream.
es: También es posible hacer el camino contrario: realizar los cambios en la subcarpeta `rack` de la rama 'master', para posteriormente fusionarlos en la rama `rack_branch` y remitirlos a los encargados del mantenimiento o enviarlos aguas arriba.

source: Insert 18333fig0337.png Figure 3-37.
es: Insert 18333fig0337.png Figura 3-37.

source: One simple workflow merges your work into your `master` branch.
es: Una forma simple de trabajar es fusionandolo todo en tu rama 'master'.

source: If you decide to sign the tag as the maintainer, the tagging may look something like this:
es: Si decides firmar la etiqueta como gestor de mantenimientos que eres, el proceso será algo como:

source: When you download data, the `fetch-pack` and `upload-pack` processes are involved.
es: Cuando descargas datos, los procesos que se ven envueltos son `fetch-pack` (recuperar paquete) y `upload-pack` (enviar paquete).

source: Creating a new repository on GitHub.
es: Creando un nuevo repositorio en GitHub.

source: You can use it to notify a group or the author of the patch you pulled in that you’ve done so.
es: Puedes utilizarlo para notificar de su aplicación al grupo o al autor del parche.

source: The other listing in the `git status` output is the rack entry.
es: Dos: la entrada `rack`.

source: At this point, the `fetch-pack` process looks at what objects it has and responds with the objects that it needs by sending "want" and then the SHA it wants.
es: En este punto, el proceso `fetch-pack` revisa los objetos que tiene y responde indicando los objetos que necesita. Enviando "want" (quiero) y la clave SHA que necesita.

source: The `branches` directory isn’t used by newer Git versions, and the `description` file is only used by the GitWeb program, so don’t worry about those.
es: La carpeta 'branches' no se utiliza en las últimas versiones de Git, y el archivo 'description' se utiliza solo en el programa GitWeb; por lo que no necesitas preocuparte por ellos.

source: This Perl snippet strips out anything it sees in a `$Date$` string, to get back to where you started.
es: Esta expresión Perl extrae cualquier cosa que vea dentro de una cadena '$Date$', para devolverla a como era en un principio.

source: You need a file in which you can store the SHA-1 value under a simple name so you can use that pointer rather than the raw SHA-1 value.
es: Necesitarias un archivo donde almacenar los valores de las sumas de comprobación SHA-1, junto con sus respectivos nombres simples que puedas utilizar como enlaces en lugar de la propia suma de comprobación.

source: The first line also has a list of the server’s capabilities (here, `report-status` and `delete-refs`).
es: La primera linea suele indicar también una lista con las capacidades del servidor, (en este caso `report-status` --dar situación-- y `delete-refs` --borrar referencias--).

source: Let’s say you decide to pull in your server branch as well.
es: Ahora supongamos que decides traerlos (pull) también sobre tu rama 'server'.

source: The first parent is the branch you were on when you merged, and the second is the commit on the branch that you merged in:
es: El primer padre es el proveniente de la rama activa al realizar la fusión, y el segundo es la confirmación de cambios en la rama desde la que se fusiona.

source: It’s very easy for patches or other collaborated work to introduce subtle whitespace changes because editors silently introduce them or Windows programmers add carriage returns at the end of lines they touch in cross-platform projects.
es: Es muy facil que algunos parches u otro trabajo recibido introduzcan sutiles cambios de espaciado, porque los editores suelen hacerlo inadvertidamente o, trabajando en entornos multi-plataforma, porque programadores Windows suelen añadir retornos de carro al final de las lineas que tocan.

source: Now you have a directory named `gitosis-admin`, which has two major parts:
es: Con ello, tendrás una carpeta denominada 'gitosis-admin', con dos partes principales dentro de ella:

source: The packfile is a single file containing the contents of all the objects that were removed from your filesystem.
es: El archivo empaquetador es un único archivo conteniendo dentro de él todos los objetos sueltos eliminados del sistema de archivo.

source: ### Branch References ###
es: ### Referencias a ramas ###

source: The `config` file contains your project-specific configuration options, and the `info` directory keeps a global exclude file for ignored patterns that you don’t want to track in a .gitignore file.
es: El archivo 'config' contiene las opciones de configuración específicas de este proyecto concreto, y la carpeta 'info' guarda un archivo global de exclusión con los patrones a ignorar ademas de los presentes en el archivo .gitignore.

source: This is often called a pull request, and you can either generate it via the website — GitHub has a "pull request" button that automatically messages the maintainer — or run the `git request-pull` command and e-mail the output to the project maintainer manually.
es: Normalmente se suele hacer a través de una solicitud de recuperación/integración (pull request). La puedes generar directamente desde el sitio web, --GitHub tiene un botón "pull request" que notifica automáticamente al gestor--, o puedes lanzar el comando 'git request-pull' y enviar manualmente su salida por correo electrónico al gestor del proyecto.

source: You can also specify another group as one of the members (using `@` as prefix), to inherit all of its members automatically:
es: También puedes indicar un grupo como miembro de otro (utilizado el prefijo '@'), para incluir todos sus miembros automáticamente:

source: A contributor clones that repository and makes changes.
es: Una persona que desea contribuir, clona dicho repositorio y hace algunos cambios.

source: Everything merges cleanly, and Jessica’s history looks like Figure 5-9.
es: Todo se integra limpiamente, y el historial de Jessica queda como en la Figura 5-9.

source: Other options are `100755`, which means it’s an executable file; and `120000`, which specifies a symbolic link.
es: Otras opciones son `100755`, para un achivo ejecutable; o `120000`, para un enlace simbólico.

source: If you set this to the path of a file on your system, Git will use that file as the default message when you commit.
es: Si preparas este ajuste para apuntar a un archivo concreto de tu sistema, Git lo utilizará como mensaje por defecto cuando hagas confirmaciones de cambio.

source: First, you must be relatively careful when working in the submodule directory.
es: El primero de los cuales es la necesidad de ser bastante cuidadoso cuando se trabaja en la carpeta de un submódulo.

source: Now, each of your topics is contained within a silo — similar to a patch queue — that you can rewrite, rebase, and modify without the topics interfering or interdepending on each other as in Figure 5-16.
es: De esta forma, cada uno de los temas está aislado dentro de un silo, --similar a una cola de parches--; permitiendote reescribir, reorganizar y modificar cada uno de ellos sin interferir ni crear interdependencias entre ellos.

source: How much work are you contributing at a time?
es: ¿Con cuánto trabajo contribuyes?.

source: Insert 18333fig0524.png Figure 5-24.
es: Insert 18333fig0524.png Figura 5-24.

source: If you want to see which files are unmerged at any point after a merge conflict, you can run `git status`:
es: Para ver qué archivos permanecen sin fusionar en un determinado momento conflictivo de una fusión, puedes usar el comando 'git status':

source: ### The Shortlog ###
es: ### El registro rápido ###

source: The issue with vendoring the code into your own project is that any custom changes you make are difficult to merge when upstream changes become available.
es: La problemática en el segundo caso radica en las complicaciones para fusionar las personalizaciones realizadas por nosotros con futuras copias de la biblioteca original.

source: They’re all also within the packfile you just downloaded, so you don’t have to do any more requests to your server.
es: Y, como estás también están dentro del archivo empaquetado que acabas de descargar, ya no necesitas hacer mas peticiones al servidor.

source: All Git objects are stored the same way, just with different types — instead of the string blob, the header will begin with commit or tree.
es: Todos los demas objetos Git se almacenan de forma similar, pero con la diferencia de que sus cabeceras comienzan con un tipo diferente. En lugar de 'blob' (objeto binario grande), comenzarán por 'commit' (confirmación de cambios), o por 'tree' (árbol).

source: You can look into the packfile and see what Git did to save space.
es: Puedes comprobarlo mirando en el interior del archivo empaquetador.

source: In most scenarios, if you want color codes in your redirected output, you can instead pass a `--color` flag to the Git command to force it to use color codes.
es: En la mayor parte de las ocasiones, cuando necesites códigos de color en los resultados, es mejor indicar puntualmente la opción '--color' en el comando concreto, para obligarle a utilizar códigos de color.

source: Create a branch for a new story you’re working on.
es: Creas una rama para un nuevo tema sobre el que quieres trabajar.

source: Set your key ID like so:
es: Configurando tu clave ID de esta forma:

source: If you want to see a list of all the options your version of Git recognizes, you can run
es: Si quieres consultar una lista completa, con todas las opciones contempladas en tu versión de Git, puedes lanzar el comando:

source: This way, you can set up HTTP-based read access to any of your projects for a fair number of users in a few minutes.
es: De esta manera, puedes preparar en cuestión de minutos accesos de lectura basados en HTTP a tus proyectos, para grandes cantidades de usuarios.

source: General sequence of events for a simple multiple-developer Git workflow.
es: Secuencia general de eventos en un flujo de trabajo multidesarrollador simple.

source: You can also manually repack at any time by running `git gc` by hand.
es: Pero, también tu mismo puedes reempaquetar en cualquier momento, lanzando manualmente el comando `git gc`.

source: The git fetch command updates your remote references.
es: El comando 'git fetch' actualiza tus referencias remotas.

source: Or, to compare what is in your `rack` subdirectory with what the `master` branch on the server was the last time you fetched, you can run
es: O, otro ejemplo: para comparar el contenido de la subcarpeta `rack` con la rama `master` en el servidor:

source: This command also exits with a non-zero status if the check fails, so you can use it in scripts if you want.
es: Además, este comando retorna con un status no-cero en caso de fallar la comprobación, por lo que puedes utilizarlo en scripts si lo deseas.

source: To run `filter-branch` on all your branches, you can pass `--all` to the command.
es: Si se desea lanzar `filter-branch` sobre todas las ramas del repositorio, se ha de pasar la opción `--all` al comando.

source: If you replace an image in your project and run `git diff`, you see something like this:
es: Si sustituyes alguna de las imagenes en tu proyecto, y lanzas el comando 'git diff' obtendrás algo como:

source: ### More Interesting Rebases ###
es: ### Algunas otras reorganizaciones interesantes ###

source: If you run it with no arguments, you get a simple listing of your current branches:
es: Si lo lanzas sin argumentos, obtienes una lista de las ramas presentes en tu proyecto:

source: It’s generally easier to think about them as work silos, where sets of commits graduate to a more stable silo when they’re fully tested (see Figure 3-19).
es: Podría ser más sencillo pensar en las ramas como si fueran silos de almacenamiento. Donde grupos de confirmaciones de cambio (commits) van promocionando hacia silos más estables a medida que son probados y depurados (ver Figura 3-19)

source: Formatting and whitespace issues are some of the more frustrating and subtle problems that many developers encounter when collaborating, especially cross-platform.
es: El formato y los espacios en blanco son la fuente de los problemas más sutiles y frustrantes que muchos desarrolladores se pueden encontrar en entornos colaborativos, especialmente si son multi-plataforma.

source: Assume that you have the rack files in a subdirectory of your project, and you want to switch it to a submodule.
es: Asumiendo que se tenian archivos en una carpeta 'rack' del proyecto, y que se desea intercambiarla por un submódulo.

source: If you run a `log`, you see something like this:
es: En este último, se suele ver algo así como:

source: You have to be careful, though, because the `.gitattributes` file is committed and passed around with the project but the driver (in this case, `dater`) isn’t; so, it won’t work everywhere.
es: No obstante, debes de ser cuidadoso, ya que el archivo '.gitattibutes' se almacena y se transmite junto con el proyecto; pero no así el propio filtro, (en este caso, 'dater'), sin el cual no puede funcionar.

source: If you delete the subdirectory and then run `submodule add`, Git yells at you:
es: Si se borra la carpeta y luego se lanza un comando `submodule add`, Git avisará de "carpeta ya existente en el índice":

source: Doing so moves the `iss53` branch forward, because you have it checked out (that is, your HEAD is pointing to it; see Figure 3-12):
es: Con ello avanzas la rama 'iss53', que es la que tienes activada (checked out) en este momento (es decir, a la que apunta HEAD; ver Figura 3-12):

source: So, these are scripts to help developers, and they must be set up and maintained by them, although they can be overridden or modified by them at any time.
es: Por tanto, estos scripts son para ayudar a los desarrolladores, y, como tales, han de ser configurados y mantenidos por ellos, pudiendo ser sobreescritos o modificados por ellos en cualquier momento.

source: Now, you can run `git fetch teamone` to fetch everything server has that you don’t have yet.
es: Ahora, puedes usar el comando 'git fetch teamone' para recuperar todo el contenido del servidor que tu no tenias.

source: This leaves four important entries: the `HEAD` and `index` files and the `objects` and `refs` directories.
es: Esto nos deja con cuatro entradas importantes: los archivos 'HEAD' e 'index' y las carpetas 'objects' y 'refs'.

source: The `format-patch` command prints out the names of the patch files it creates.
es: El comando `format-patch` lista los nombres de los archivos de parche que crea.

source: You can name this file `expand_date` and put it in your path.
es: Puedes llamar 'expand_date' a este archivo y ponerlo en el path de ejecución.

source: She can do so by specifying the local branch followed by a colon (:) followed by the remote branch to the `git push` command:
es: Puede hacerlo usando el comando 'git push' e indicando específicamente el nombre de la rama local seguida de dos puntos (:) y seguida del nombre de la rama remota:

source: Having a good guideline for creating commits and sticking to it makes working with Git and collaborating with others a lot easier.
es: Disponer unas reglas claras para crear confirmaciones de cambios, y seguirlas fielmente, facilta enormemente tanto el trabajo con Git y como la colaboración con otras personas.

source: ### Stashing Your Work ###
es: ### Guardando el trabajo temporalmente ###

source: It’s like a branch reference, but it never moves — it always points to the same commit but gives it a friendlier name.
es: Es como una referencia a una rama, pero permaneciendo siempre inmovil, --apuntando siempre a la misma confirmación de cambios--, dándo un nombre mas amigable a esta.

source: ### Centralized Workflow ###
es: ### Flujo de trabajo centralizado ###

source: It tries to run a command on the remote server via an SSH call that looks something like this:
es: En el servidor remoto, a través de una llamada SSH, intentará lanzar un comando tal como:

source: The big object is at the bottom: 2MB.
es: El archivo enorme es el último: 2 MB (2056716 Bytes para ser exactos).

source: Now you want to switch branches, but you don’t want to commit what you’ve been working on yet; so you’ll stash the changes.
es: Si justo en este momento se desea cambiar de rama, pero sin confirmar los cambios realizados hasta entonces; la solución es un guardado rápido provisional de los cambios.

source: You can delete a remote branch using the rather obtuse syntax `git push [remotename] :[branch]`.
es: Puedes borrar la rama remota utilizando la un tanto confusa sintaxis: 'git push [nombreremoto] :[rama]'.

source: This is how other people who clone this project know where to get the submodule projects from.
es: Así es como otras personas que clonen el proyecto pueden saber dónde encontrar los submódulos del mismo.

source: There are a lot of client-side hooks.
es: Hay muchos de ellos.

source: A push to the project takes the `gitosis.conf` file you just pushed up and sticks it there.
es: Un envio (push) de cambios al proyecto, coge el archivo 'gitosis.conf' enviado y sobreescribe con él el del servidor.

source: The Your Clone URL is a read/write SSH-based URL that you can read or write over only if you connect with the SSH private key associated with the public key you uploaded for your user.
es: El enlace "Your Clone URL", es un enlace de lectura/escritura basado en SSH; a través del cual puedes leer y escribir, pero solo si te conectas con la clave SSH privada correspondiente a la clave pública que has cargado para tu usuario.

source: If you commit those changes and check out the file again, you see the keyword properly substituted:
es: Al confirmar cambios (commit) y luego extraer (checkout) el archivo de vuelta, verás la clave sutituida:

source: You’ll learn how to work in an environment where small groups collaborate on features and then those team-based contributions are integrated by another party.
es: Aprenderás cómo trabajar en un entorno donde pequeños grupos colaboran en algunas funcionalidades, y luego todas las aportaciones de esos equipos son integradas por otro grupo.

source: At this point, you should be able to visit `http://gitserver/` to view your repositories online, and you can use `http://git.gitserver` to clone and fetch your repositories over HTTP.
es: En este momento, deberias poder visitar 'http://gitserver/' para ver tus repositorios online. Y utilizar 'http://git.gitserver' para clonar (clone) y recuperar (fetch) tus repositorios a través de HTTP.

source: If you’ve allowed everyone to connect with a single user (like "git") via public-key authentication, you may have to give that user a shell wrapper that determines which user is connecting based on the public key, and set an environment variable specifying that user.
es: Si has permitido a cualquiera conectarse con un mismo usuario (como "git", por ejemplo), has tenido que dar a dicho usuario una envoltura (shell wraper) que te permite determinar cual es el usuario que se conecta según sea su clave pública, permitiendote fijar una variable de entorno especificando dicho usuario.

source: Here you’ll see how to do the same rack embedding as in the last section, but using subtree merges instead.
es: En este caso se va a mostrar cómo se haria el mismo empotramiento del módulo rack tomado como ejemplo anteriormente, pero utilizando fusiones de subarbol en lugar de submódulos.

source: To do this properly, you need a small script that takes a filename, figures out the last commit date for this project, and inserts the date into the file.
es: Para hacerlo, necesitas un pequeño script que coja el nombre de un archivo, localice la fecha de la última confirmación de cambios en el proyecto, e inserte dicha información en el archivo.

source: ### Deleting Remote Branches ###
es: ### Borrando ramas remotas ###

source: # Git Internals #
es: # Los entesijos internos de Git #

source: They have another parallel branch named develop or next that they work from or use to test stability — it isn’t necessarily always stable, but whenever it gets to a stable state, it can be merged into `master`.
es: Teniendo otras ramas paralelas denominadas 'desarrollo' o 'siguiente', en las que trabajan y realizan pruebas. Estas ramas paralelas no suele estar siempre en un estado estable; pero cada vez que sí lo están, pueden ser fusionadas con la rama 'master'.

source: #### Multiple Points ####
es: #### Puntos multiples ####

source: For example, to change your `extDiff` and `extMerge` tools to run the KDiff3 tool instead, all you have to do is edit your `extMerge` file:
es: Por ejemplo, para cambiar tus scripts 'extDiff' y 'extMerge' para utilizar KDiff3, tan solo has de editar el archivo 'extMerge:

source: This is important because with more and more developers, you run into more issues with making sure your code applies cleanly or can be easily merged.
es: Esto es importante, ya que cuantos más desarrolladores haya, mayores serán los problemas para asegurarte de que tu código se integre limpiamente.

source: You begin by reading this data into a structure that you can use.
es: Para implementarlo, hemos de leer previamente estos datos en una estructura que podamos emplear.

source: Jessica’s history after fetching John’s changes.
es: El historial de Jessica tras recuperar los cambios de John.

source: #### Rebasing and Cherry Picking Workflows ####
es: #### Flujos de trabajo reorganizando o entresacando ####

source: The book’s first eight chapters deal almost exclusively with porcelain commands.
es: Los primeros ocho capítulos de este libro se encargan casi exclusivamente de los comandos de porcelana.

source: When you’re branching and merging, everything is being done only in your Git repository — no server communication is happening.
es: Cuando ramificas y fusionas, todo se realiza en tu propio repositorio Git. No hay nigún tipo de tráfico con ningún servidor.

source: ### Basic Merging ###
es: ### Procedimientos básicos de fusión ###

source: But in this chapter, you’ll be dealing mostly with the lower-level plumbing commands, because they give you access to the inner workings of Git and help demonstrate how and why Git does what it does.
es: Pero en este capítulo trataremos sobre todo con los comandos de fontaneria; comandos que te darán acceso a los entresijos internos de Git y que te ayudarán a comprender cómo y por qué hace Git lo que hace como lo hace.
